Revit 2027 API
RebarCoupler.GetPointsForPlacement Method
 gets the point (or points in case of rebar set) where the coupler is placed
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetPointsForPlacement()
Public Function GetPointsForPlacement As IList(Of XYZ)
public:
IList<XYZ^>^ GetPointsForPlacement()
member GetPointsForPlacement : unit -> IList<XYZ>
Return Value
IList<XYZ>
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace